# Создаем словарь с кодами азбуки Морзе
MORSE_CODE = {
    'A': '.-', 'B': '-...', 'C': '-.-.',
    'D': '-..', 'E': '.', 'F': '..-.',
    'G': '--.', 'H': '....', 'I': '..',
    'J': '.---', 'K': '-.-', 'L': '.-..',
    'M': '--', 'N': '-.', 'O': '---',
    'P': '.--.', 'Q': '--.-', 'R': '.-.',
    'S': '...', 'T': '-', 'U': '..-',
    'V': '...-', 'W': '.--', 'X': '-..-',
    'Y': '-.--', 'Z': '--..',
    '0': '-----', '1': '.----', '2': '..---',
    '3': '...--', '4': '....-', '5': '.....',
    '6': '-....', '7': '--...', '8': '---..',
    '9': '----.'
}

# Вводим текст
text = input()

# Разбиваем текст на слова
words = text.split()

# Проходим по каждому слову и заменяем в нем буквы на соответствующие коды азбуки Морзе
for i in range(len(words)):
    word = words[i]
    # Проходим по каждой букве в слове и кодируем ее
    encoded_word = ''
    for letter in word:
        encoded_word += MORSE
